const gdud = {
    title:"גדוד",
    pageTitle:`מבנה ייעוד ותפקידי
פלוגת המפקדה
`,
    color: '#499f8a',
    desteny:{
        title:`ייעוד פלוגת המפקדה בגדוד`,
        text:[
            <>
            מתן שירותים לוגיסטיים לכוחות הגדוד בתחומי לוגיסטיקה, הספקה, אחזקה, רכב, תקשוב, מחנה, משא"ן ואנו"ח,<br/>  
            כדי לקיים את היכולת המבצעית ולאפשר רציפות והמשכיות לביצוע משימות הגדוד.<br/>  
            
            </>
        ]
    },
    tasks:{
        title:`תפקידי פלוגת המפקדה בגדוד`,
        text:[
            <>

            <b>  בשגרה:</b><br /><br />
                
            1. מתן שירותי לוגיסטיקה, הספקה, אחזקה, תקשוב, אנו"ח ומשא"ן לכוחות הגדוד במסגרת אימונים ותע"ם.  <br/>
            2. טיפול בנושא הלוגיסטיקה במסגרת הגדוד.  <br/>
            3. טיפול בנושאי הדת והחינוך במסגרת הגדוד.  <br/>
            4. קיום שגרת פעילות גדודית על פי הפקודות והנהלים.  <br/>
            <b>  בחירום:</b><br /><br />

            1. ייעוץ למג"ד בתחומי לוגיסטיקה, הספקה, אחזקה, רכב, תקשוב, משא"ן ואנו"ח.  <br/>
            2. תמיכה לוגיסטית בכוחות הפועלים באירוע על בסיס ארגון "חצר אחורית".  <br/>
            3. ניהול שטחי כינוס.  <br/>
            4. תכנון צירי תנועה והספקה.  <br/>
            5. דחיפת הספקה לכוחות.  <br/>
            6. החזרה לכשירות בתום אירוע הרס.  <br/>
            7. ביצוע הערכת מצב, דיווחים שוטפים ודרישות שוטפות לרמה ממונה בנושאי אחזקה, הספקה, תקשוב וצר"פ.  <br/>

            <b>  בתע"מ:</b><br /><br />
            1. ביצוע תהליך היערכות סדור טרם העליה לתע"מ לרבות סיורים להכרת וניתוח הגזרה, תאומי ציפיות אל מול החטמ"ר, המחוז והנפה ולמידת לקחים ופערים מהגדוד היורד.<br/>
            2. פיקוד ושליטה על פלוגת המפקדה במהלך התע"מ והובלת מתן מענה לוגיסטי מיטבי לגדוד.<br/>
            3. שמירה על רמת כשירות גבוהה בהיבטי הניוד לצורך המבצעי והמנהלתי – טיפול בתרלות ע"י אנשי המפקדה או בתיאום אל מול החטמ"ר והגורמים המקצועיים.<br/>
            4. שליטה בתחום המזון לכוחות הגדוד בכלל המוצבים.<br/>
            5. מענה בתחום הנשק – בחינות וטיפולים חודשיים, מענה לתקלות ע"י אנשי המפקדה או בתיאום למול החטמ"ר ודיווח לרמ"מ ע"פ הפקודות.<br/>
            6. שליטה בניהול תחום הארמו"ן – טיפול בתחמושת ובונקר וניהול הנשקיה ע"פ הפקודות.<br/>
            7. ביצוע הערכות מצב לוגיסטיות שבועיות ותרגול הערכת מצ"ב בשוע"ל במהלך התע"מ.<br/>


    </>],
    },
    imgSrc: `${process.env.PUBLIC_URL}/assets/gdud/gdudFirst.jpg`,
    imgDescription:`לפניכם עץ מבנה לפלוגת המפקדה  בגדוד.
                    בהמשך הדף יש לבחור את המכלולים לקבלת פירוט הגדרות ומשימות התפקיד -`,
    comandor:{
        name:`מ"פ מפקדה`,
        src:`${process.env.PUBLIC_URL}/assets/imgs/GdudComandor.svg`,
        popupTitle:`מ"פ מפקדה`,
        popupText:[
           
              <>
              <b> ייעוד מפקדת פלוגת המפקדה: :</b><br /><br />
              ניהול פלוגת המפקדה, פיקוד ושליטה על כוחות הפלוגה ומשימותיה לשם מתן מענה לוגיסטי מיטבי לכוחות הגדוד.
              <b> תפקידי פלוגת המפקדה:</b><br /><br />
                <b> בשגרה:</b><br /><br />
                1. ביצוע אימוני שמירת כשירות. <br/>
                2. וידוא כשירות ציוד החירום של הפלוגה וארגון הציוד לפי השיבוץ הקרבי בשעת חירום ולפי הפק"ל המבצעי למעבר משגרה לחירום. <br/>
                3. ביצוע סיורים להכרת הגזרה המבצעית, הימ"ח ושטחי הכינוס. <br/>
                4. פיקוד ושליטה על המחלקות המקצועיות לטובת מתן שירותי לוגיסטיקה, הספקה ואחזקה, תקשוב, אנו"ח ומשא"ן לכוחות הגדוד במסגרת אימונים, הכשרות ותע"ם. <br/><br/>
                <b> בחירום:</b><br /><br />
                1. פיקוד ושליטה על מסגרות הפלוגה במהלך ניהול הקרב ותפעול החפ"ק על עזריו ואמצעיו. <br/>
                2. הפעלת מחלקות הפלוגה למתן מענה לוגיסטי לכוחות הגדוד הפועלים באירועים השונים, מחוץ לאיזור הסיכון, בהיבטי הספקה, אחזקה, בינוי ותשתיות, משא"ן, דת וקשר. <br/>
                3. גיבוש תמונת מצב וביצוע הערכת מצב לוגיסטית, תוך מעקב אחר כשירות האמצעים, כוח האדם, חוסרים באמצעים מול התקן וצורך בריענון אמצעים. <br/>
                4. העברת דיווחים שוטפים לנפה והעברת דרישות לצורכי הגדוד לפי העיתוי הקבוע בשעון הלחימה ובהתאם לצורך. <br/>
                5. תכנון צירי תנועה וקווי אספקה לכוחות לפי האירוע והצורך. <br/>
                6. תיאום מענה תקשוב ואחזקה לגדוד בדגש על תיקונים וטיפולי דרג א' באמצעות מחלקות התקשוב והטנ"א. <br/>
                    <b>  בתע"מ:</b><br /><br />
            1. ביצוע תהליך היערכות סדור טרם העליה לתע"מ לרבות סיורים להכרת וניתוח הגזרה, תאומי ציפיות אל מול החטמ"ר, המחוז והנפה ולמידת לקחים ופערים מהגדוד היורד.<br/>
            2. פיקוד ושליטה על פלוגת המפקדה במהלך התע"מ והובלת מתן מענה לוגיסטי מיטבי לגדוד.<br/>
            3. שמירה על רמת כשירות גבוהה בהיבטי הניוד לצורך המבצעי והמנהלתי – טיפול בתרלות ע"י אנשי המפקדה או בתיאום אל מול החטמ"ר והגורמים המקצועיים.<br/>
            4. שליטה בתחום המזון לכוחות הגדוד בכלל המוצבים.<br/>
            5. מענה בתחום הנשק – בחינות וטיפולים חודשיים, מענה לתקלות ע"י אנשי המפקדה או בתיאום למול החטמ"ר ודיווח לרמ"מ ע"פ הפקודות.<br/>
            6. שליטה בניהול תחום הארמו"ן – טיפול בתחמושת ובונקר וניהול הנשקיה ע"פ הפקודות.<br/>
            7. ביצוע הערכות מצב לוגיסטיות שבועיות ותרגול הערכת מצ"ב בשוע"ל במהלך התע"מ.<br/>

          </>
        
        ]

    },
    subComandor:{
        name:`סמ"פ מפקדה `,
        src:`${process.env.PUBLIC_URL}/assets/gdud/subComandor.svg`,
        taskTitle: ` תפקידי סגן מפקד מפקדה  `,

        taskText: [
            <>
                1. ממלא את תפקיד המפ"ם בהיעדרו.<br/>
                2. מפקד כח הרקמ"ה בעת גיוס.<br/>
                3. מנהל את שגרת הפלוגה (מחנה ומבצעית) באופן שוטף.<br/>
                4. עיסוק והובלת תחום הבטיחות בפלוגה על כלל מרכיביו – בטיחות בדרכים, באימונים, בנשק, שגרה מבצעית ועוד.<br/>
                5. אחראי על תחום ההובלות וההיסעים של הגדוד.<br/>
                
            </>

        ],
        roles: [
            {
                idRole: 1,
                roleName: <> נגד לוגיסטיקה</>,
                src:`${process.env.PUBLIC_URL}/assets/gdud/subSolider.svg`,
             


            },
            {
                idRole: 2,
                roleName: <>פקיד</>,
                src:`${process.env.PUBLIC_URL}/assets/gdud/subSolider.svg`


            },
            {
                idRole: 3,
                roleName: <>נהג מ"פ</>,
                src:`${process.env.PUBLIC_URL}/assets/gdud/subSolider.svg`

            }
        ],
        treeSrc: `${process.env.PUBLIC_URL}/assets/gdud/gdudSubCom.jpg`
        //לפרק  DiagramStep3SubCom כי אין פה EXPLANTION


    },



    subRoles:[
    {
        id: 1,
        name: `מחלקת לוגיסטיקה`,
        firstRoleName:`קל"ג`,
        srcSolider:`${process.env.PUBLIC_URL}/assets/gdud/solider.svg`,
        taskTitle:`התפקידי מפקד מחלקת קל"ג`,

        taskNote: [
            <>
                1. מנהל מחלקת הלוגיסטיקה בגדוד – מטבח, ארמו"ן, תחמושת, אפסנאות.<br/>
                2. מטבח – אחראי לתפקוד תחום המזון כראוי וסיפוק מענה מיטבי לגדוד.<br/>
                3. ארמו"ן – אחראי על תחום הארמו"ן ובקרה על עמידה בפקודות – ביצוע "ירוק בעיניים", טיפולי נשק, טיפול בתקלות, ספירות נשק, החתמות ועוד. בקרה על מוסמכי הארמו"ן.<br/>
                4. תחמושת – מוודא עמידה בפקודות – ביצוע ספירות, אחסנה מתאימה, צריכה בהתאם לצורך.<br/>
                5. מזון – ניהול מנהל המטבח ווידוא מענה מיטבי לגדוד – הזמנה, ניהול מוצרים טריים, שינוע מסון בהתאם לצורך, מענה לכוחות במשימות.<br/>
                6. שיח שוטף אל מול הרס"פים בגדוד לדאגה לצרכי הפלוגות.<br/>

              
            </>
        ],
        roles: [
            {
                idRole: 1,
                roleName: " נגד מטבח",                
                src:`${process.env.PUBLIC_URL}/assets/gdud/subSolider.svg`,
                taskTitle:`תפקידי נגד מטבח`,

                taskNote: [
                    <>
                        1. אחריות על תחום המזון בגדוד מקצה לקצה.<br/>
                        2. בנייה וניהול תכנית המזון הגדודית – הזמנה, תקלות, גיוון ושינוע.<br/>
                        3. מענה הולם במזון לכלל החיילים - תקלות, גיוון ומענה עד אחרון החיילים בכלל נקודות הפריסה של הגדוד – שט"כים, אתרי הרס, מחנה וכו'.<br/>
                        4. ניהול מלאי המזון הגדודי – פג"ת, גיוון, מזון ופרודוקטים טריים במידה וקיימים.<br/>

                      
                    </>
                    ]


            },
            {
                idRole: 2,
                roleName: " נגד אפסנאות",                
                src:`${process.env.PUBLIC_URL}/assets/gdud/subSolider.svg`,
                taskTitle:`תפקידי נגד אפסנאות`,

                taskNote: [
                    <>
                        1. אחראי על המלאי הרישומי של היחידה.<br/>
                        2. מנהל העבודה בתחום הלוגיסטיקה בפלוגה.<br/>
                        3. אחראי על ניפוק וזיכוי ציוד לחיילי הגדוד.<br/>
                        4. אחריות על קבלת ציוד מהגלמ"ר, רישומו וסידורו בפלוגה.<br/>
                        5. העברת המלצה לדרישות עבור צרכי הגדוד ועצמאות פלוגת המפקדה.<br/>

                      
                    </>
                    ]
            },
            {
                idRole: 3,
                roleName: " קצין רכב",                
                src:`${process.env.PUBLIC_URL}/assets/gdud/subSolider.svg`,
                taskTitle:`תפקידי  קצין רכב `,

                taskNote: [
                    <>
                        קיים תוכן צריך להוסיף
                      
                    </>
                    ]
            }
        ],
        treeSrc: `${process.env.PUBLIC_URL}/assets/gdud/gdudKalag.jpg`,
        explanation: [
            {
                titleExplanation: " ייעוד מחלקת התחזוקה והשירותים:",
                textExplanation:
                    [
                        <>
                             מתן שירותים לוגיסטיים לגדוד במסגרת פלוגת המפקדה בתחומי הלוגיסטיקה, האפסניה, המטבח והרכב.
                        </>

                    ]
            },
            {
                titleExplanation: " תפקידי מחלקת התחזוקה והשירותים:",
                textExplanation:
                    [
                        <>
                            מתן מענה לוגיסטי בתחומים הבאים:<br/>  
                            1. לוגיסטיקה שוטפת.<br/>  
                            2. שירותי מחנה.<br/>  
                            3. הסעדה וכלכלה.<br/>  
                        </>

                    ]
            }
        ]
    },

    {
        id: 2,
        name: `מחלקת הטנ"א`,
        firstRoleName:`קט"א`,
        srcSolider:`${process.env.PUBLIC_URL}/assets/gdud/solider.svg`,
        taskTitle:`תפקידי מפקד מחלקת הטנ"א`,

        taskNote: [
            <>
            קצין הטנ"א הגדודי הוא קצין מטה העוזר למג"ד, מתאם ומרכז את נושא הטנ"א בגדוד.<br/>
הקט"א הוא מפקד מחלקת הטנ"א בגדוד במסגרת פלוגת המפקדה.<br/>
הקט"א כפוף למג"ד, מתואם על ידי מ"פ המפקדה ומונחה מקצועית על ידי קצין הטנ"א הנפתי.<br/><br/>
<b>תפקידים בשגרה</b><br/>
1. אימון מחלקת הטנ"א ותרגולה והשלמת הכשרות לחסרי ההכשרה.<br/>
2. ווידוא עמידת מחלקת הטנ"א בתקני כוח אדם וציוד והשלמת הפערים במידת הצורך.<br/>
3. ייעוץ למג"ד בנושאי טנ"א.<br/>
4. ריכוז דיווחי טנ"א והעברתם לרמות הממונות (דו"ח כשירות).<br/>
5. כתיבת נספח אחזקה במסגרת התוכניות הגדודיות וסעיף אחזקה בפקודת המבצע.<br/>
6. מהווה סמכות מקצועית עליונה בגדוד לזמינות אפסניית ח"יח (חיל הטנ"א).<br/>
7. תכנון תחזוקת אפסניית ח"יח בגדוד לרבות תכנון הטיפולים, התיקונים והחילוץ.<br/>
8. פיקוח על כשירות האמל"ח.<br/>
9. ריכוז ותכנון תחום הבטיחות בעבודה.<br/>
10. ויסות כוח אדם מקצועי ואמצעים לביצוע משימות התחזוקה.<br/>
11. ריכוז תחום הגרירה.<br/>
12. טיפול בכוח אדם: שמירת כשירות מקצועית על ידי ביצוע השתלמויות מקצועיות ושמירת כשירות גוף האחזקה בגדוד.<br/>
13. אחריות לאחזקה בתעסוקה מבצעית (בט"ש).<br/><br/>
<b>תפקידים בחירום</b><br/>

1. הוצאת ציוד מהחסנה יבשה והימ"חים והכשרתו.<br/>
2. ריכוז דו"חות כשירות, הפקת משמעויות והצגתן למפקד.<br/>
3. שליטה בכוח אדם טנ"א והפעלת מחלקת הטנ"א הגדודית בהתאם לתפיסת התחזוקה.<br/>
4. העברת דרישות סיוע אחזקה ודו"ח כשירות לרמה הממונה.<br/>
5. ווידוא ביצוע טיפולים בהתאם לשגרת התחזוקה.<br/>


            </>

        ],
        roles: [
            {
                idRole: 1,
                roleName: `ע' קט"א`,
                src:`${process.env.PUBLIC_URL}/assets/gdud/subSolider.svg`, 
                taskTitle:`תפקידי ע' קט"א `,

                taskNote: [
                    <>
                        קיים תוכן צריך להוסיף
                      
                    </>
                    ]


            }
        ],
        treeSrc: `${process.env.PUBLIC_URL}/assets/gdud/gdudKta.jpg`,
        explanation: [
            {
                titleExplanation: `ייעוד מחלקת הטנ"א:`,
                textExplanation:
                    [
                        <>
                           להוות מסגרת למענה אחזקתי מיטבי לצל"ם ולציוד הייעודי בגדוד החילוץ בדרג א' ושמירה על כשירות גבוהה
                        </>

                    ]
            },
            {
                titleExplanation: `תפקידי מחלקת הטנ"א:`,
                textExplanation:
                    [
                        <>
                            1. מתן שירותי אחזקה בדרג א' לצל"ם הגדוד.<br/>  
                            2. ביצוע תיקוני דרג א'.<br/>  
                            3. טיפול באמצעי הגדוד הייעודיים ובגנרטורים.<br/>  
                            4. ביצוע פעולות חילוץ ופינוי רכב.<br/>  
                            5. מתן מענה תחזוקתי לאמצעי נשק ואלקטרו-אופטיקה.<br/>  
                            6. מתן ייעוץ לגדוד בנושא טיפול בדרג מפעיל לאמצעים השונים.<br/>  
                            7. אחריות לקיום שגרת טיפולים נכונה לאמצעי החימוש השונים.<br/>  
                            8. סיוע בתיאום אספקת חלקי חילוף, דרישת אמצעים מול תא אחזקה בנפה.<br/>  
                            9. ריכוז דו"ח כשירות אמצעים בדגש על כלי רכב ואמצעים ייעודיים בשגרה ובחירום.<br/>  
                        </>

                    ]
            }
        ]
    },

    {
        id: 3,
        name: `מחלקת התקשוב`,
        firstRoleName:`ק' תקשוב`,
        srcSolider:`${process.env.PUBLIC_URL}/assets/gdud/solider.svg`,
        taskTitle:`תפקידי מפקד מחלקת התקשוב`,

        taskNote: [
            <>
                קצין התקשוב מתואם על ידי מייפ המפקדה ומונחה מקצועית על ידי קצין התקשוב הנפתי.<br/><br/>
                <b>תפקידים בשגרה</b><br/>
                1. קצין מטה מקצועי ויועץ למג"ד בנושא קשר ושליטה.<br/>
                2. אחריות לתכנון מענה התקשוב בכל מתארי הפעילות.<br/>
                3. מתן הנחיות לגבי ביצוע האזנות לרשתות בחפ"ק הגדודי וברכבי המפקדים בעזרת המש"קים במפג"ד ובפלוגות.<br/>
                4. אחריות לתחזוקת אמצעי התקשוב (רדיו ושו"ב) בגדוד בשגרה ובחירום.<br/>
                5. אחריות לאימון ולהדרכת תקשוב של כל חיילי היחידה (מפעילים, מפקדים, צוותים וקשרים).<br/>
                6. אימון מחלקת התקשוב ותרגולה והשלמת הכשרות לחסרי ההכשרה.<br/>
                7. ווידוא עמידת מחלקת התקשוב בתקני כוח אדם וציוד והשלמת הפערים במידת הצורך.<br/>
                8. הכנת מרשמי הקשר (רדיו, טלפוניה ושו"ב) בגדוד במסגרת הפקודה הגדודית.<br/>
                9. ווידוא זמינות ציוד הקשר והתקשוב הנדרש בגדוד.<br/>
                10. אחריות להפצת הק"ש לבעלי התפקידים, הקצאת תדרים ועדכון שוטף של השינויים.<br/>
                11. כתיבת סעיף השליטה ונספח הקשר בפקודה הגדודית וכתיבת פקייל התקשוב הגדודי.<br/><br/>

                <b>תפקידים בחירום</b><br/>
                1. ביצוע מעבר משגרה לחירום כמתחייב בפקודות.<br/>
                2. פריסת מערכות התקשוב בגדוד, הפעלתן ואחזקתן והבטחת כשירותן המבצעית.<br/>
                3. הצגת משמעויות קשר ואמצעים נדרשים בעת קבלת מטלה במסגרת המחוז, הנפה וגופים אחרים.<br/>
                4. הדרכת חיילי הגדוד בנושא הפעלת אמצעי התקשוב.<br/>
                5. כתיבת סעיף השליטה ונספח התקשוב בפקודה הגדודית.<br/>
         
                
            </>

        ],
        roles: [
            {
                idRole: 1,
                roleName:`ימפעיל תקשוב מבצע`,
                src:`${process.env.PUBLIC_URL}/assets/gdud/subSolider.svg`,
                taskTitle:`תפקידי מפעיל תקשוב מבצעי `,

                taskNote: [
                    <>
                        קיים תוכן צריך להוסיף
                      
                    </>
                    ]
           

            },
            {
                idRole: 2,
                roleName: `קשר עורף ומפעיל שו"ב`,
                src:`${process.env.PUBLIC_URL}/assets/gdud/subSolider.svg`
            },
            {
                idRole: 3,
                roleName:`מפעיל רדיו`,
                src:`${process.env.PUBLIC_URL}/assets/gdud/subSolider.svg`
            },
            {
                idRole: 4,
                roleName:`טכנאי מערכות מחשוב`,
                src:`${process.env.PUBLIC_URL}/assets/gdud/subSolider.svg`
            },
            {
                idRole: 5,
                roleName:`מש"ק אלחוטן`,
                src:`${process.env.PUBLIC_URL}/assets/gdud/subSolider.svg`
            }
           
        ],
        treeSrc: `${process.env.PUBLIC_URL}/assets/gdud/gdudTykshuv.jpg`,
        explanation: [
            {
                titleExplanation:`תפקידי מחלקת התקשוב`,
                textExplanation:
                    [
                        <>
                            1. מתן מענה תקשובי, תקשורת ומחשוב למפקדת הגדוד והפלוגות.<br/>  
                            2. הקמת מערכות התקשוב בגדוד, תפעולן, תחזוקתן ושמירת כשירותן המבצעית בהתאם לנספחי התקשוב המחייבים.<br/>  
                            3. התקנת מכשירי קשר בכלי רכב ובחפ"ק לפי מרשמי הרדיו.<br/>  
                            4. ביצוע בדיקות הפעלה ושמישות לכלל המכשירים וכיול שלהם בתדרים וברשתות.<br/>  
                            5. הפעלת רשת השו"ב הגדודית ושמירת תקינות כל המחשבים ואמצעי התקשוב הנלווים אצל בעלי התפקידים.<br/>  
                            6. חלוקה של הק"ש לרמת מ"מ ומעלה ועדכונו באופן שוטף.<br/>  
                            7. תחזוקת דרג א' לאמצעי התקשוב בגדוד.<br/>  
                            8. ניהול אפסניית התקשוב בגדוד.<br/>  
                        </>

                    ]
            },
            {
                titleExplanation:`ייעוד מחלקת התקשוב `,
                textExplanation:
                    [
                        <>
                           לתת מענה תקשובי בגדוד כדי לאפשר פיקוד ושליטה על הכוחות והיחידות הכפופות בכל מתארי הפעילות, בשגרה ובחירום.

                        </>
                    ]
            }
        ]
    },

    {
        id: 4,
        name: `מחלקת המשא"ן`,
        firstRoleName:`ק' משא"ן`,
        srcSolider:`${process.env.PUBLIC_URL}/assets/gdud/solider.svg`,
        taskTitle:`   תפקידי מפקד מחלקת המשא"ן`,

        taskNote: [
            <>
              
                קצין השלישות מתאם את נושאי השלישות ובכללם השגרה בגדוד, גיוס הגדוד וטיפול בשעת חירום.<br/> מפקד מחלקת השלישות בגדוד בתוך פלוגת המפקדה. הקש"ל כפוף למג"ד ומונחה מקצועית על ידי קצין השלישות הנפתי.<br/><br/>
                 <b>תפקידים בשגרה</b><br/>
               1. מוכנות לחירום – עדכניות ערכות קליטה, שבצ'יק תקין, מסד נתונים מהימן.<br/>
            2. תרגול ואימון מחלקת השלישות והשלמת הכשרות לחסרי ההכשרה.<br/>
            3. ניהול משאבי כוח האדם:<br/>
            - ייעוץ למג"ד בתחום כוח האדם בגדוד.<br/>
            - מעקב שבצ"ק ורידוד או גריעת סדייכ שאינו מתאים.<br/>
            - אחריות על עדכניות קבוצות הקריאה של הרקמייה.<br/>
            - מעקב וטיפול בנפגעים ובעריקים.<br/>
            - מעקב כוח אדם מוכשר לבעלי התפקידים בגדוד.<br/>
            - גיוס כוח אדם (הוצאת צווים, מיון, קליטה ושחרור) מול קצין הקישור – בתיאום מול המבצעים.<br/>
            4. סיוע בניהול שגרת הגדוד – ראיונות אישיים, פקודות, משפטים, דואר, חינוך, דת, שהיית הגדוד.<br/>
            5. מעקב אחר נפגעים וחללים.<br/>
            6. ריכוז טפסים ודוחות והעברתם (שיבוץ, שחרור משמ"פ, דוח 1, התייצבות, פיזור, נפגעים וכדומה).<br/><br/>

                <b>תפקידים בחירום</b><br/>
             1. סיוע בניהול שגרת הגדוד – פקודות, משפטים, דואר, עיתונים, חינוך, דת, שהייה.<br/>
            2. מעקב אחר היערכות הגדוד בנושא פינוי וטיפול בנפגעים ובחללים.<br/>
            3. מעקב כשירות ושחיקת סד"כ וגזירת משמעויות מבצעיות.<br/>
            4. סיוע בגיוס סד"כ הגדוד.<br/>
            5. סיוע בגיוס סד"כ רקמייה וקליטתו.<br/>
            6. שליטה בכוח אדם – מתגייס, נפגע, לפני אירוע, במהלכו ולאחריו.<br/>
            7. דיווח וטיפול בחללים, בנפגעים ובנעדרים של הגדוד.<br/>
         
            </>

        ],
        roles: [
            {
                idRole: 1,
                roleName:`רכז כוח אדם`,
                src:`${process.env.PUBLIC_URL}/assets/gdud/subSolider.svg`
           

            },
            {
                idRole: 2,
                roleName: `פקיד`,
                src:`${process.env.PUBLIC_URL}/assets/gdud/subSolider.svg`
            },
            {
                idRole: 3,
                roleName:`מש"ק דת`,
                src:`${process.env.PUBLIC_URL}/assets/gdud/subSolider.svg`
            },
            {
                idRole: 4,
                roleName:`שלם`,
                src:`${process.env.PUBLIC_URL}/assets/gdud/subSolider.svg`
            },
            {
                idRole: 5,
                roleName:`מש"ק חינוך ות"ש`,
                src:`${process.env.PUBLIC_URL}/assets/gdud/subSolider.svg`
            }
           
        ],
        treeSrc: `${process.env.PUBLIC_URL}/assets/gdud/gdudMashan.jpg`,
        explanation: [
            {
                titleExplanation:`תפקידי מחלקת המאש"ן`,
                textExplanation:
                    [
                        <>
                            1. ניהול משאבי כוח האדם בגדוד.<br/>  
                            2. ניהול שגרת הגדוד (פקודות, משפטים).<br/>  
                            3. ניהול תחום הדת, הפרט והחינוך בגדוד.<br/>  
                            4. שליטה בכוח אדם ומעקב אחר נפגעים.<br/>  
                            5. טיפול בדיווח על חללים צבאיים.<br/>  
                            6. ריכוז נתוני משא"ן במסגרת דו"חות וטפסים.<br/>  
                        </>

                    ]
            },
            {
                titleExplanation:`ייעוד מחלקת המשא"ן `,
                textExplanation:
                    [
                        <>
                            1. שליטה בכוח אדם מתפקד ונפגע (לרבות טיפול בחללים).<br/>  
                            2. בניית הכוח וארגון הכוח בהתאם למדיניות מפקדת המחוז ולצורכי היחידות.<br/>  
                            3. ריכוז הטיפול בנושאי רווחת הפרט והיחידה ואת משימות הרבנות והאנו"ח בגזרת הנפה.<br/>  
                        </>
                    ]
            }
        ]
    },

    

    {
        id: 5,
        name: `מחלקת האנו"ח`,
        firstRoleName:`מ"מ האנו"ח`,
        srcSolider:`${process.env.PUBLIC_URL}/assets/gdud/solider.svg`,
        taskTitle:`תפקידי מ"מ האנו"ח`,
        taskNote: [
            <>
מ"מ האנו"ח בוגר קורס קציני אנו"ח וקורס רבנים צבאיים וכפוף למ"פ המפקדה.   
   <b>תפקידים בשגרה</b><br/>
                1. אחריות להקמת המחלקה ולשמירה על כשירותה במסגרת אימוני הגדוד.<br/>
                2. ווידוא כשירות ימ"ח המחלקה וארגון הציוד לפי השיבוץ הקרבי בשעת חירום והפק"ל המבצעי למעבר משגרה לחירום.<br/>
                3. פיקוד על כוחות המחלקה בשירות מילואים פעיל ובתעסוקה מבצעית.<br/>
                4. אחריות להקמת התא"ח ושמירת כשירותו במסגרת אימוני הגדוד.<br/>
                5. ווידוא תיאום היר"ם (יחידת רכב מגויס) אשר נמשך בחירום.<br/>

                <b>תפקידים בחירום</b><br/>
                1. פיקוד ושליטה על המחלקה בחירום.<br/>
                2. פיקוד ושליטה על תהליך הקמת התא"ח הגדודי.<br/>
                3. תיאום שינוע החללים מהתא"ח לתחנת ריכוז חללים (תר"ח).<br/>
                4. תיאום בין כיתות המחלקה למפקדת פלוגת הרפואה.<br/>
                5. תיאום משימות הסיוע האזרחי.<br/>
        </>

        ],
        roles: [
            {
                idRole: 1,
                roleName:`מש"ק סריקה`,
                src:`${process.env.PUBLIC_URL}/assets/gdud/subSolider.svg`
            },
            {
                idRole: 2,
                roleName:`נהג רכב קל`,
                src:`${process.env.PUBLIC_URL}/assets/gdud/subSolider.svg`
            },
            {
                idRole: 3,
                roleName:`סורק `,
                src:`${process.env.PUBLIC_URL}/assets/gdud/subSolider.svg`
            },
            {
                idRole: 4,
                roleName:`נהג משא כבד`,
                src:`${process.env.PUBLIC_URL}/assets/gdud/subSolider.svg`
            }
           
        ],
        treeSrc: `${process.env.PUBLIC_URL}/assets/gdud/gdudAnoch.jpg`,
        explanation: [
            {
                titleExplanation:`תפקידי מחלקת האנו"ח`,
                textExplanation:
                    [
                        <>
                            <b>בשגרה:</b><br /> 
                            1. אימון מחלקת אנו"ח ותרגולה והשלמת הכשרות לחסרי ההכשרה. <br/>  
                            2. וידוא עמידת מחלקת האנו"ח בתקני כוח אדם וציוד והשלמת הפערים במידת הצורך. <br/>  
                            3. וידוא כשירות ציוד החירום של המחלקה וארגון הציוד על פי השיבוץ הקרבי בשעת חירום והפק"ל המבצעי למעבר משגרה לחירום. <br/>  
                            4. הכנת האימונים הגדודיים בתחום האנו"ח. <br/> <br/>
                            <b>בחירום:</b><br />  
                            1. ביצוע סריקות לאיתור החללים. <br/>  
                            2. איסוף נתונים ותיעוד החללים. <br/>  
                            3. איסוף חללים בזירה ופינויים לתחנת איסוף חללים גדודית. <br/>  
                            4. הפעלת תחנת איסוף חללים גדודית. <br/>  
                            5. פינוי חללים אזרחיים לתחנת ריכוז חללים של פס"ח. <br/>  <br/>
                        </>

                    ]
            },
            {
                titleExplanation:`ייעוד מחלקת האנו"ח`,
                textExplanation:
                    [
                        <>
                           מחלקת הנו"ח תבצע איסוף נתונים וחללים מזירת האירוע ופינויים לתחנת ריכוז חללים.<br/> <br/>
                        </>
                    ]
            }
        ]
    },

    

    
    ]
}

export default gdud;