const units = [
    {name:"גדוד חילוץ - חוד חנית",
        steps:[
            <>ציוד מיגון אישי, ציוד חילוץ קל, חפ"ק מג"ד, ציוד תקשוב גדודי.</>,
            <>ציוד חילוץ כבד פלוגתי וגדודי, מיכלי תדלוק.</>,
            <>נשק, תחמושת, ציוד רפואי</>,
            <> <b>סבבים מנהלתיים</b>: מנות קרב, ארגזי כלים, ציוד אנו"ח, רמות מלאי, אמצעי שהייה, פק"ל נתק, פק"ל רס"פ, שקי חפצים, מעילים, שקי שינה, מדי </>,
        ],
         stepNumbers: ["1", "2-3", "4", "5-9"],
    },
    {
        name:"גדוד חילוץ -איתן",
        steps:[
            <>ציוד מיגון אישי, ציוד ייעודי קל, חפ"ק מג"ד, ציוד תקשוב גדודי.</>,
            <>ציוד ייעודי כבד (פלוגתי וגדודי), מיכלי תדלוק.</>,
            <>נשק, תחמושת, ציוד רפואי</>,
            <> <b>סבבים מנהלתיים:</b>  מנות קרב, ארגזי כלים, ציוד אנו"ח, רמות מלאי, אמצעי שהייה, פק"ל נתק, פק"ל רס"פ, שקי חפצים, מעילים, שקי שינה, מדים</>,
    
        ],
         stepNumbers: ["1", "2-3", "4", "5-9"],
        },
    {
        name: "גדוד יערה",
        steps:[
            <>נשקים, אופטיקה, צל"ם גדודי, תחמושת</>,
            <>שקי חפצים, ציוד רפואי, ציוד מיגון אישי</>,
            <> <b>סבבים מנהלתיים:</b> מנות קרב, אמצעי שהייה, פק"ל נתק, פק"ל רס"פ, רמות מלאי, ארגזי כלים, מעילים, שקי שינה</>,

        ],
         stepNumbers: ["1", "2", "3-8"],
    },
    {
        name: "פלוגות מהירות",
        steps:[
            <>ציוד מיגון אישי, ציוד ייעודי קל, חפ"ק מג"ד, ציוד תקשוב גדודי.</>,
            <>ציוד ייעודי כבד (פלוגתי וגדודי), מיכלי תדלוק.</>,
            <>נשק, תחמושת, ציוד רפואי</>,
            <> <b>סבבים מנהלתיים:</b>  מנות קרב, ארגזי כלים, ציוד אנו"ח, רמות מלאי, אמצעי שהייה, פק"ל נתק, פק"ל רס"פ, שקי חפצים, מעילים, שקי שינה, מדים</>,
    
        ] ,
     stepNumbers: ["1", "2-3", "4", "5-9"],   },
    {
        name: `גדוד אב"כ`,
        steps:[
        <>ציוד מיגון אישי, ציוד ייעודי קל, חפ"ק מג"ד, ציוד תקשוב גדודי.</>,
        <>ציוד ייעודי כבד (פלוגתי וגדודי), מיכלי תדלוק.</>,
        <>נשק, תחמושת, ציוד רפואי</>,
        <> <b>סבבים מנהלתיים:</b>  מנות קרב, ארגזי כלים, ציוד אנו"ח, רמות מלאי, אמצעי שהייה, פק"ל נתק, פק"ל רס"פ, שקי חפצים, מעילים, שקי שינה, מדים</>,

    ],
     stepNumbers: ["1", "2-3", "4", "5-9"],
    }
]

export default units;
