const validations = [
    {
     id: 1,
     name: "הערכת מצב פלוגת המפקדה:",
     people: [
        {
            id: 1,
            name: "סמב\"ץ",
            time: "5 דק'",
            content: `
                פריסת כוחות
                תמ"צ עולם ועורף
                אירועים עיקריים
                מטרה
                משימת הפלוגה
                רעיון ושיטה לוגיסטית
                משימות לשלב הנוכחי ושלב הבא
            `
        },
        {
            id: 2,
            name: "קצין רפואה ",
            time: "2 דק'",
            content: <>
            כשירות פלוגת רפואה
                כשירות כ"א
                כשירות הציוד (מלאי ציוד, רמת שחיקה, ציוד שנצרך ודרישות השלמת ציוד)
                משימות בביצוע
                משימות להמשך
                פערים-משמעויות-המלצות
                </>
        },
        {
            id: 3,
            name:`קצין משא"ן`,
            time: "3 דק'",
            content: `
                כשירות המסגרות (סד"כ מתפקד, נפגע וחסר, צפי לקבלת כ"א + כוחות חבירים)
                משימות בביצוע
                משימות להמשך
                פערים-משמעויות-המלצות
            `
        },
        {
            id: 4,
            name: `קצין טנ"א`,
            time: "3 דק'",
            content: `
                מיקומי צוותים בשטח
                כשירות הציוד (תקלות, מלאי חלפים, כלים בתיקון בגדוד ובדרג ב')
                משימות בביצוע
                משימות להמשך
                פערים-משמעויות-המלצות
            `
        },
        {
            id: 5,
            name: "קל\"ג",
            time: "3 דק'",
            content: `
                כשירות הציוד (פערים, חוסרים, צפי להשלמת ציוד)
                משימות בביצוע
                משימות להמשך
                פערים-משמעויות-המלצות
            `
        },
        {
            id: 6,
            name: "ק. תקשוב",
            time: "2 דק'",
            content: `
                כשירות הציוד (חוסרים, ציוד שנדרש למשוך / להעביר)
                משימות בביצוע
                משימות להמשך
                פערים-משמעויות-המלצות
            `
        },
        {
            id: 7,
            name: `מ"מ אנו"ח`,
            time: "2 דק'",
            content: `
                כשירות כ"א
                כשירות הציוד (מלאי ציוד, רמת שחיקה)
                משימות בביצוע
                משימות להמשך
                פערים-משמעויות-המלצות
            `
        },
        {
            id: 8,
            name: "מפ\"מ",
            time: "5 דק'",
            content:<> קביעת סדר עדיפות לוגיסטי <br/>
            המלצות לציר אג"מי <br/>
            המלצות לרמ"מ <br/>
            סיכום וחלוקת משימות <br/></>
        }
    ]
    },
    {
     id: 2,
     name: "הערכת מצב מלכ\"א נפה:",
     people: [
        {
            id: 1,
            name: "מבצעים",
            time: "8 דק'",
            content: `
                סטטוס ביצוע הנחיות מהערכת מצב קודמת
                מטרה
                משימה
                סד"כ מגוייס
                מרשם קרב
                עיקרי תמ"צ עולם
                עיקרי תמ"צ נפתי (אירועים מרכזיים, שגרת חירום, פו"ש, רמ"מ)
                המשימה הלוגיסטית
                עזר המנהלה ומשמעויות מהעזר
            `
        },
        {
            id: 2,
            name: "הספקה",
            time: "5 דק'",
            content: `
                עיקרי תמ"צ הספקה:
                כשירות הסד"כ המבצעי
                אורך נשימה ורמות מלאי
                תמיכה במימד הקיום כולל מענה בתחום הבינוי
                רמ"מ
            `
        },
        {
            id: 3,
            name: "טנ\"א",
            time: "5 דק'",
            content: `
                עיקרי תמ"צ אחזקה:
                כשירות הצל"ם
                כשירות המסגרות האחזקתיות במרחב הנפה
                חלפים
                אמצעים
                רמ"מ
            `
        },
        {
            id: 4,
            name: "משא\"ן",
            time: "5 דק'",
            content: `
                עיקרי תמ"צ משא"ן:
                סד"כ וכשירות מסגרות כפופות
                פערי מקצועות קריטיים
                פילוח נפגעים ולוויות
                תספיקי פרט ורבנות
                רמ"מ
            `
        },
        {
            id: 5,
            name: "רפואה",
            time: "3 דק'",
            content: `
                כשירות צר"פ
                רפואה במרחב האזרחי
                תמ"צ רכבי פינוי
                רמ"מ
            `
        },
        {
            id: 6,
            name: "תקשוב",
            time: "3 דק'",
            content: `
                סטטוס מימוש תכנית לוג' תקשוב
                רמות מלאי
                אמצעי ניוד ואמצעי תקשוב
                רמ"מ
            `
        },
        {
            id: 7,
            name: "התייחסות משתתפים",
            time: "4 דק'",
            content: `
                התייחסות משתתפים
            `
        },
        {
            id: 8,
            name: "קל\"ן",
            time: "7 דק'",
            content: `
                סיכום הערכת המצב:
                הנחיות לתאים
                הנחיות ליחידות כפופות
                המלצות לציר המבצעי
                דרישות מרמה ממונה
            `
        }
    ]
    }
]

export default validations;
